1_history_of_c/1_history_of_c.md

# Table of Contents

1.  [What will you learn?](#orgbb161b7)
2.  [What is C?](#orgeed0ca5)
3.  [Where does C come from?](#org6d27a32)
4.  [How important is C?](#org543f7ab)
5.  [What is the difference between C and C++?](#orgc047e05)
6.  [Why are we not just learning C++?](#org33650c6)
7.  [Why am I teaching C/C++?](#org025b480)
8.  [What's next?](#orgcec60db)
9.  [References](#org58f2807)



<a id="orgbb161b7"></a>

# What will you learn?

-   What is C?
-   What is its origin?
-   What is its importance?
-   What's the difference to C++?
-   Why are we not just learning C++?
-   What are C's strengths and weaknesses?
-   Why are you learning C from me?
-   What's next in the course?

Source: [King (2008) ch.1](#org6deca29)


<a id="orgeed0ca5"></a>

# What is C?

C is a widely used high-level programming language developed in the
early 1970s at Bell Laboratories. 


<a id="org6d27a32"></a>

# Where does C come from?

Cp. K&R ([Kernighan/Ritchie, 1978](#orgf0fbe35))


<a id="org543f7ab"></a>

# How important is C?


<a id="orgc047e05"></a>

# What is the difference between C and C++?


<a id="org33650c6"></a>

# Why are we not just learning C++?


<a id="org025b480"></a>

# Why am I teaching C/C++?


<a id="orgcec60db"></a>

# What's next?


<a id="org58f2807"></a>

# References

<a id="org6deca29"></a> King (2008). C Programming - A Modern
Approach. Norton. [Online: knking.com](http://knking.com/books/c2/index.html).

<a id="orgf0fbe35"></a> Kernighan/Ritchie (1978). The C Programming
Language. Prentice Hall. [Online: wikipedia.org](https://en.wikipedia.org/wiki/The_C_Programming_Language).

